<a href="https://colab.research.google.com/github/brendanpshea/database_sql/blob/main/Database_06_WritingData.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Introduction
When working with databases, one of the most fundamental tasks is **writing data to tables**. In SQL, this is accomplished using the `INSERT INTO` statement. This statement allows you to add new rows of data to a table, specifying the values for each column. Additionally, you can use **constraints** to enforce rules and maintain data integrity within your tables.

In this chapter, we will explore the process of writing data to SQL tables using the `INSERT INTO` statement. We will cover both single-row and multiple-row insertions, and discuss what happens when constraints are violated. We will also touch on related topics such as `DELETE FROM`, "soft delete," `UPDATE`, and **triggers**.

To make our examples more concrete, we will be working with a sample database based on Rolling Stone's Greatest Albums of All Time. We will create tables for artists and albums, populate them with data, and demonstrate various scenarios related to writing data to SQL tables.

By the end of this chapter, you will have a solid understanding of how to insert data into SQL tables, handle constraints, and perform common data manipulation operations. Let's dive in and start exploring the world of writing data to SQL tables!

## Creating Tables for Rolling Stone's Greatest Albums of All Time

Before we can start inserting data into our database, we need to create the necessary tables. In this case, we'll create two tables: Artist and Album. Let's define the structure of these tables and include some constraints to ensure data integrity.

In [1]:
%load_ext sql
%sql sqlite:///greatest.db

In [2]:
%%sql
DROP TABLE IF EXISTS Artist;
DROP TABLE IF EXISTS Album;
CREATE TABLE Artist (
    ArtistID INT PRIMARY KEY,
    Name VARCHAR(100) NOT NULL,
    Country VARCHAR(50),
    Founded INT
    CHECK (Founded >= 1900 AND Founded <= 2023)
);

CREATE TABLE Album (
    AlbumID INT PRIMARY KEY,
    Title VARCHAR(100) NOT NULL,
    ArtistID INT,
    ReleaseYear INT,
    Genre VARCHAR(50),
    Ranking_2023 INT CHECK (Ranking_2023 >= 1 AND Ranking_2023 <= 500),
    FOREIGN KEY (ArtistID) REFERENCES Artist(ArtistID),
    CHECK (ReleaseYear >= 1900 AND ReleaseYear <= 2023)
);

 * sqlite:///greatest.db
Done.
Done.
Done.
Done.

[]

Let's break down the key aspects of these table definitions:

-   The `Artist` table has an `ArtistID` column as the **primary key**, which uniquely identifies each artist. The `Name` column is marked as `NOT NULL`, ensuring that every artist has a name. We also have `Country` and `Founded` columns to store additional information about the artists.
-   The `Album` table has an `AlbumID` column as the primary key. The `Title` column is marked as `NOT NULL` to ensure that every album has a title. We have a foreign key `ArtistID` that references the `ArtistID` column in the `Artist` table, establishing a relationship between albums and artists. The `ReleaseYear` and `Genre` columns provide additional details about each album.
-   We include **check constraints** in both tables to enforce certain conditions. In the `Artist` table, we ensure that the `Founded` year is between 1900 and 2023. Similarly, in the `Album` table, we check that the `ReleaseYear` is within the same range.

By creating these tables with appropriate constraints, we set up a solid foundation for our database. The constraints help maintain data integrity by preventing invalid or inconsistent data from being inserted into the tables.

Now that we have our tables ready, we can start inserting data into them using the `INSERT INTO` statement, which we'll explore in the next section.

## Using INSERT INTO (Single Row)


Now that we have our `Artist` and `Album` tables created, let's explore how to insert a single row of data into each table using the `INSERT INTO` statement.

The basic syntax for inserting a single row is as follows:

```sql
INSERT INTO table_name (column1, column2, ...)
VALUES (value1, value2, ...);
```

Let's insert a single artist into the `Artist` table:

In [3]:
%%sql
--Insert Marvin Gaye
INSERT INTO Artist (ArtistID, Name, Country, Founded)
VALUES (1, 'Marvin Gaye', 'United States', 1939);

 * sqlite:///greatest.db
1 rows affected.

[]

In this example, we specify the table name `Artist` and list the columns we want to insert data into (`ArtistID`, `Name`, `Country`, `Founded`). We then provide the corresponding values for each column using the `VALUES` clause. The values are listed in the same order as the columns specified.

Now, let's insert a single album into the `Album` table:

In [4]:
%%sql
-- Insert What's Going On
INSERT INTO Album (AlbumID, Title, ArtistID, ReleaseYear,Genre, Ranking_2023)
VALUES (1, 'What''s Going On', 1, 1971, 'Soul', 1);

 * sqlite:///greatest.db
1 rows affected.

[]

In [5]:
%sql SELECT * FROM Album;

 * sqlite:///greatest.db
Done.

[(1, "What's Going On", 1, 1971, 'Soul', 1)]

Similarly, we specify the `Album` table and list the columns we want to insert data into. We provide the corresponding values in the `VALUES` clause, ensuring that the `ArtistID` matches the `ArtistID` of the artist we inserted earlier.

It's important to note that when inserting data, we need to provide values for all columns that are marked as `NOT NULL` or do not have a default value defined. If we omit a column that allows `NULL` values or has a default value, the database will automatically assign the appropriate value.

By using the `INSERT INTO` statement, we can easily add single rows of data to our tables. This is particularly useful when we have specific values for each column and want to insert them one at a time.

In the next section, we'll explore how to insert multiple rows of data in a single statement, which is more efficient when dealing with larger datasets.

## Using INSERT INTO (Multiple Rows)

Inserting data one row at a time can be inefficient when you have a large number of records to insert. Fortunately, SQL allows you to insert multiple rows of data in a single `INSERT INTO` statement. This is achieved by specifying multiple sets of values in the `VALUES` clause.

Let's insert the top 10 albums from Rolling Stone's Greatest Albums of All Time list into our database. First, we'll insert the artists:

In [6]:
%%sql
INSERT INTO Artist (ArtistID, Name, Country, Founded)
VALUES
(2, 'The Beach Boys', 'United States', 1961),
(3, 'Joni Mitchell', 'Canada', 1964),
(4, 'Stevie Wonder', 'United States', 1961),
(5, 'Nirvana', 'United States', 1987),
(6, 'Fleetwood Mac', 'United Kingdom', 1967),
(7, 'Prince', 'United States', 1975),
(8, 'Bob Dylan', 'United States', 1961),
(9, 'Lauryn Hill', 'United States', 1988),
(10, 'The Beatles', 'United Kingdom', 1960),
(11, 'Radiohead', 'United Kingdom', 1985),
(12, 'Kendrick Lamar', 'United States', 2003),
(13, 'Public Enemy', 'United States', 1985),
(14, 'The Rolling Stones', 'United Kingdom', 1962),
(15, 'Aretha Franklin', 'United States', 1956),
(16, 'Michael Jackson', 'United States', 1964),
(17, 'Kanye West', 'United States', 1996),
(19, 'The Clash', 'United Kingdom', 1976);

 * sqlite:///greatest.db
17 rows affected.

[]

Now, let's insert the corresponding albums:

In [7]:
%%sql
INSERT INTO Album (AlbumID, Title, ArtistID, ReleaseYear, Genre, Ranking_2023)
VALUES
(2, 'Pet Sounds', 2, 1966, 'Rock',2),
(3, 'Blue', 3, 1971, 'Folk',3),
(4, 'Songs in the Key of Life', 4, 1976, 'Soul',4),
(5, 'Nevermind', 5, 1991, 'Grunge',5),
(6, 'Rumours', 6, 1977, 'Soft Rock',6),
(7, 'Purple Rain', 7, 1984, 'Pop',7),
(8, 'Blood on the Tracks', 8, 1975, 'Folk Rock',8),
(9, 'The Miseducation of Lauryn Hill', 9, 1998, 'Hip Hop',9),
(10, 'Abbey Road', 10, 1969, 'Rock',10),
(11, 'Revolver', 10, 1966, 'Rock',11),
(12, 'Thriller', 16, 1982, 'Pop',12),
(13, 'I Never Loved a Man the Way I Love You', 15, 1967, 'Soul',13),
(14, 'Exile on Main Street', 14, 1972, 'Rock',14),
(15, 'It Takes a Nation of Millions to Hold Us Back', 13, 1988, 'Hip Hop',15),
(16, 'London Calling', 19, 1979, 'Punk',16),
(17, 'My Beautiful Dark Twisted Fantasy', 17, 2010, 'Hip Hop',17),
(18, 'Highway 61 Revisited', 8, 1965, 'Folk Rock',18),
(19, 'To Pimp a Butterfly', 12, 2015, 'Hip Hop',19),
(20, 'Kid A', 11, 2000, 'Electronic',20);

 * sqlite:///greatest.db
19 rows affected.

[]